menu_home = \u0413\u043B\u0430\u0432\u043D\u0430\u044F
menu_download = \u0421\u043A\u0430\u0447\u0430\u0442\u044C
menu_documentation = \u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u044F
menu_faq = FAQ
seo_keywords = erlang, web, framework, mvc, django, rails, \u0432\u0435\u0431, \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A
seo_description = Beepbeep \u2014 \u044D\u0442\u043E \u043C\u0438\u043A\u0440\u043E\u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0435 \u0441\u0442\u043E\u0438\u0442 \u0443 \u0432\u0430\u0441 \u043D\u0430 \u043F\u0443\u0442\u0438. BeepBeep \u2014 \u044D\u0442\u043E \u043F\u0440\u043E\u0441\u0442\u043E\u0435 \u0432\u0435\u0431-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043D\u0430 \u042D\u0440\u043B\u0430\u043D\u0433\u0435 \u0432\u0434\u043E\u0445\u043D\u043E\u0432\u0435\u043D\u0438\u0435\u043C \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043F\u043E\u0441\u043B\u0443\u0436\u0438\u043B\u0438 by Rails and Merb \u0441 \u043F\u0440\u0438\u0432\u043A\u0443\u0441\u043E\u043C Django
framework_slogan = Beepbeep \u2014 \u044D\u0442\u043E \u043C\u0438\u043A\u0440\u043E\u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A \u0434\u043B\u044F \u042D\u0440\u043B\u0430\u043D\u0433\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043D\u0435 \u0441\u0442\u043E\u0438\u0442 \u0443 \u0432\u0430\u0441 \u043D\u0430 \u043F\u0443\u0442\u0438
buzzwords_to_get_started = \u0427\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u0437\u0430\u0438\u043D\u0442\u0435\u0440\u0435\u0441\u043E\u0432\u0430\u0442\u044C\:
fast = \u0421\u043A\u043E\u0440\u043E\u0441\u0442\u044C\!
buzzword_middleware = Middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u043F\u043E \u0442\u0438\u043F\u0443 \u0414\u0436\u0430\u043D\u0433\u043E
q_a_microframework = \u041C\u0438\u043A\u0440\u043E\u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A?
description_microframework = \u0412 \u043E\u0442\u043B\u0438\u0447\u0438\u0435 \u043E\u0442 \u043C\u043D\u043E\u0433\u0438\u0445 \u0434\u0440\u0443\u0433\u0438\u0445 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043D\u0430\u0432\u044F\u0437\u044B\u0432\u0430\u044E\u0442 \u00AB\u043E\u0434\u0438\u043D-\u0435\u0434\u0438\u043D\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0439 \u043F\u0443\u0442\u044C \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438\u00BB\t(\u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0438\u0432\u0430\u044F \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u0447\u0438\u043A\u0430 Javascript-\u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430\u043C\u0438, \u0442\u0438\u043F\u043E\u043C \u043F\u043E\u0434\u0441\u043E\u0435\u0434\u0438\u043D\u0435\u043D\u0438\u044F \u043A \u0431\u0430\u0437\u0430\u043C \u0434\u0430\u043D\u043D\u044B\u0445 \u0438 \u0442.\u043F. ), BeepBeep \u043D\u0430\u0432\u044F\u0437\u044B\u0432\u0430\u0435\u0442 \u0442\u043E\u043B\u044C\u043A\u043E MVC \u0438 MochiWeb (\u0441\u043C. \u0442\u0430\u043A\u0436\u0435 <a href\="/ru-RU/documentation/roadmap/">\u043F\u043B\u0430\u043D \u0440\u0430\u0437\u0432\u0438\u0442\u0438\u044F</a>).\n\
	\n\
	\u0422\u043E\u043B\u044C\u043A\u043E \u043E\u0442 \u0432\u0430\u0441 \u0437\u0430\u0432\u0438\u0441\u0438\u0442, \u043A\u0430\u043A\u0443\u044E \u0441\u0432\u044F\u0437\u043A\u0443 \u0441 \u0431\u0430\u0437\u0430\u043C\u0438 \u0434\u0430\u043D\u043D\u044B\u0445 \u0432\u044B\u0431\u0440\u0430\u0442\u044C, \u0438\u043B\u0438 \u043A\u0430\u043A\u0443\u044E Javascript-\u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0443 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C.\n\
	\n\
	BeepBeep \u043D\u0435 \u0431\u0443\u0434\u0435\u0442 \u044D\u0442\u043E\u043C\u0443 \u043F\u0440\u0435\u043F\u044F\u0442\u0441\u0442\u0432\u043E\u0432\u0430\u0442\u044C
q_how_it_works = \u0422\u0430\u043A \u043A\u0430\u043A \u043E\u043D\u043E \u0432\u0441\u0435 \u0442\u0430\u043A\u0438 \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442?
description_how_it_works = \u041F\u0440\u0435\u0436\u0434\u0435, \u0447\u0435\u043C \u0432\u0434\u0430\u0442\u044C\u0441\u044F \u0432 \u0442\u0435\u0445\u043D\u0438\u0447\u0435\u0441\u043A\u0438\u0435 \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u043E\u0441\u0442\u0438, \u043B\u0443\u0447\u0448\u0435 <a href\="/ru-RU/documentation/get-started/">\u0441\u0440\u0430\u0437\u0443 \u0432\u0441\u0435 \u043E\u043F\u0440\u043E\u0431\u043E\u0432\u0430\u0442\u044C</a> \u0441\u0430\u043C\u043E\u043C\u0443\n\
	\n\
	\u041F\u043E\u0441\u043B\u0435 \u044D\u0442\u043E\u0433\u043E \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u0433\u0440\u0443\u0437\u0438\u0442\u044C\u0441\u044F \u0432 <a href\="/ru-RU/documentation/innards/">\u0434\u0435\u0442\u0430\u043B\u0438 \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438</a> \u0438 <a href\="/ru-RU/documentation/roadmap/">\u043F\u043B\u0430\u043D \u0440\u0430\u0437\u0432\u0438\u0442\u0438\u044F</a>
q_anyone_using = \u041A\u0442\u043E \u0435\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442?
description_anyone_using = BeepBeep \u2014 \u043E\u0447\u0435\u043D\u044C \u043C\u043E\u043B\u043E\u0434\u043E\u0439 \u0444\u0440\u0435\u0439\u043C\u0432\u043E\u0440\u043A, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u0441\u0430\u0439\u0442\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0435\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044E\u0442, \u043D\u0435 \u0442\u0430\u043A \u043C\u043D\u043E\u0433\u043E. \u041F\u043E\u043A\u0430 \u043D\u0435 \u0442\u0430\u043A \u043C\u043D\u043E\u0433\u043E.\n\
	\n\
	\u042D\u0442\u043E\u0442 \u0441\u0430\u0439\u0442, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u043F\u043E\u0432\u0435\u0440\u0445 BeepBeep\n\
	\n\
	\u0415\u0441\u043B\u0438 \u0432\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0435 BeepBeep, <a href\="/ru-RU/contact/">\u0441\u043E\u043E\u0431\u0449\u0438\u0442\u0435 \u043D\u0430\u043C</a>\!
q_tutorials = \u0422\u0443\u0442\u043E\u0440\u0438\u0430\u043B\u044B/\u041D\u0430\u0447\u0430\u043B\u043E \u0440\u0430\u0431\u043E\u0442\u044B
tutorials_description = \u0412 <a href\="/ru-RUails/documentation/get-started">\u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438</a> \u0435\u0441\u0442\u044C \u0441\u0435\u043A\u0446\u0438\u044F \u043E \u0442\u043E\u043C, \u043A\u0430\u043A \u043D\u0430\u0447\u0430\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441 BeepBeep\n\
	\n\
	\u0422\u0430\u043A\u0436\u0435 \u043E\u0431\u0440\u0430\u0442\u0438\u0442\u0435 \u0432\u043D\u0438\u043C\u0430\u043D\u0438\u0435 \u043D\u0430 <a href\="http\://lethain.com/tags/beepbeep/">\u0442\u0443\u0442\u043E\u0440\u0438\u0430\u043B\u044B \u0423\u0438\u043B\u043B\u0430 \u041B\u0430\u0440\u0441\u043E\u043D\u0430</a>&nbsp;<a href\="http\://lethain.com/feeds/series/intro-to-beepbeep/"><img src\="/img/rss-14x14.png" alt\="tutorials by Will Larson" /></a>
header_get_it = \u0421\u043A\u0430\u0447\u0430\u0442\u044C\:
link_on_github = <a href\="http\://github.com/dmitriid/beepbeep/network">\u043D\u0430  GitHub'\u0435</a>
header_learn_more = \u0418\u0437\u0443\u0447\u0438\u0442\u044C
link_documentation = \u0414\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u044F
link_roadmap = \u041F\u043B\u0430\u043D \u0440\u0430\u0437\u0432\u0438\u0442\u0438\u044F
link_faq = FAQ
download_instructions = \u0418\u043D\u0441\u0442\u0440\u0443\u043A\u0446\u0438\u044F \u043F\u043E \u0441\u043A\u0430\u0447\u0438\u0432\u0430\u043D\u0438\u044E
welcome = \u0414\u043E\u0431\u0440\u043E \u043F\u043E\u0436\u0430\u043B\u043E\u0432\u0430\u0442\u044C
stable_versions = \u0421\u0442\u0430\u0431\u0438\u043B\u044C\u043D\u044B\u0435 \u0432\u0435\u0440\u0441\u0438\u0438
current_version = \u0422\u0435\u043A\u0443\u0449\u0430\u044F \u0441\u0442\u0430\u0431\u0438\u043B\u044C\u043D\u0430\u044F \u0432\u0435\u0440\u0441\u0438\u044F BeepBeep \u2014 
get_it_here = \u0415\u0435 \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0437\u0434\u0435\u0441\u044C\:
development_version = \u0412\u0435\u0440\u0441\u0438\u044F \u0432 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0435
get_development_version = \u0421\u0430\u043C\u0443\u044E \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u044E\u044E \u0432\u0435\u0440\u0441\u0438\u044E, \u043D\u0430\u0445\u043E\u0434\u044F\u0449\u0443\u044E\u0441\u044F \u0432 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0435, \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0432 \u043E\u0434\u043D\u043E\u0439 \u0438\u0437 \u044D\u0442\u0438\u0445 \u0432\u0435\u0442\u043E\u043A \u043D\u0430 GitHub'\u0435 (\u043E\u0431\u0440\u0430\u0449\u0430\u0439\u0442\u0435 \u0432\u043D\u0438\u043C\u0430\u043D\u0438\u0435 \u043D\u0430 \u0434\u0430\u0442\u0443 \u0441\u043B\u0438\u044F\u043D\u0438\u044F \u0432\u0435\u0442\u043E\u043A)
fork_dave_byrson = \u0432\u0435\u0442\u043A\u0430 \u0414\u0435\u0439\u0432\u0430 \u0411\u0438\u0440\u0441\u043E\u043D\u0430
fork_dmitrii_dimandt = \u0432\u0435\u0442\u043A\u0430 \u0414\u0438\u043C\u0430\u043D\u0434\u0442\u0430 \u0414\u043C\u0438\u0442\u0440\u0438\u044F
get_development_snapshot = \u0425\u043E\u0442\u0438\u0442\u0435 \u0431\u044B\u0442\u044C \u043D\u0430 \u043F\u0435\u0440\u0435\u0434\u043D\u0435\u043C \u043A\u0440\u0430\u0435 \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438? \u0421\u043A\u0430\u0447\u0430\u0439\u0442\u0435 \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u044E\u044E \u0432\u0435\u0440\u0441\u0438\u044E \u0438\u0437 \u0440\u0435\u043F\u043E\u0437\u0438\u0442\u043E\u0440\u0438\u044F\:
then_get_started = \u0410 \u0442\u0435\u043F\u0435\u0440\u044C \u2014 <a href\="/ru-RU/documentation/get-started/">\u043D\u0430\u0447\u043D\u0438\u0442\u0435 \u0435\u0451 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C</a>\!
overview = \u041E\u0431\u0437\u043E\u0440
get_started = \u041D\u0430\u0447\u0430\u043B\u043E \u0440\u0430\u0431\u043E\u0442\u044B
working_with_beepbeep = \u0420\u0430\u0431\u043E\u0442\u0430 \u0441 BeepBeep
hooks = \u0425\u0443\u043A\u0438
technical_info = \u0422\u0435\u0445\u043D\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F
how_stuff_works = \u041A\u0430\u043A \u044D\u0442\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442
roadmap = \u041F\u043B\u0430\u043D \u0440\u0430\u0437\u0432\u0438\u0442\u0438\u044F
faq = FAQ
overview_description = BeepBeep \u2014 \u044D\u0442\u043E \u043F\u0440\u043E\u0441\u0442\u043E\u0435 \u0432\u0435\u0431-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043D\u0430 \u042D\u0440\u043B\u0430\u043D\u0433\u0435\n\
	\n\
	BeepBeep \u2014 \u044D\u0442\u043E \u043F\u0440\u043E\u0441\u0442\u043E\u0435 \u0432\u0435\u0431-\u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 \u043D\u0430 \u042D\u0440\u043B\u0430\u043D\u0433\u0435 \u0432\u0434\u043E\u0445\u043D\u043E\u0432\u0435\u043D\u0438\u0435\u043C \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u043F\u043E\u0441\u043B\u0443\u0436\u0438\u043B\u0438 by Rails and Merb.\n\
	\n\
	\u041E\u043D\u043E \u0441\u043B\u0435\u0434\u0443\u0435\u0442 \u043F\u0440\u0438\u043D\u0446\u0438\u043F\u0443 \u00AB\u0441\u043E\u0433\u043B\u0430\u0448\u0435\u043D\u0438\u0435 \u0432\u0430\u0436\u043D\u0435\u0435 \u043A\u043E\u043D\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u0438\u00BB(\u00ABconvention over configuration\u00BB). \u042D\u0442\u043E \u043E\u0437\u043D\u0430\u0447\u0430\u0435\u0442, \u0447\u0442\u043E \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u043E \u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u044C \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u0438\u043C \u043F\u0440\u043E\u0441\u0442\u044B\u043C \u043F\u0440\u0430\u0432\u0438\u043B\u0430\u043C \u043F\u043E \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044E \u043A\u043E\u0434\u0430, \u0447\u0442\u043E\u0431\u044B \u0441\u0432\u044F\u0437\u0430\u0442\u044C \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0435 \u043E\u0442 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430 \u0437\u0430\u043F\u0440\u043E\u0441\u044B \u0441 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430\u043C\u0438 \u0438 \u0444\u0430\u0439\u043B\u0430\u043C\u0438 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u044F.
features = \u041E\u0441\u043E\u0431\u0435\u043D\u043D\u043E\u0441\u0442\u0438
feature_script = \u041F\u0440\u043E\u0441\u0442\u043E\u0439 <a href\="/ru-RU/documentation/get-started/">\u0441\u043A\u0440\u0438\u043F\u0442</a> \u0434\u043B\u044F \u0433\u0435\u043D\u0435\u0440\u0430\u0446\u0438\u0438 \u0441\u043A\u0435\u043B\u0435\u0442\u0430 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F (\u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 \u043F\u043E\u0434\u0445\u043E\u0434\u0430, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u043C\u043E\u0433\u043E \u0432 mochiweb)
feature_session = \u0421\u0435\u0440\u0432\u0435\u0440 \u0441\u0435\u0441\u0441\u0438\u0439 \u0434\u043B\u044F \u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u0441\u043E\u0441\u0442\u043E\u044F\u043D\u0438\u044F \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F
feature_filters = <a href\="/ru-RU/documentation/hooks/">\u0424\u0438\u043B\u044C\u0442\u0440\u044B \u0438 \u0445\u0443\u043A\u0438</a> \u0432 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430\u0445 \u0438 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0438 \u0434\u043B\u044F \u0442\u0430\u043A\u0438\u0445 \u0432\u0435\u0449\u0435\u0439 \u043A\u0430\u043A\: \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F, \u043A\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435, \u0442\u043E\u043D\u043A\u043E\u0435 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u0440\u0435\u043D\u0434\u0435\u0440\u0438\u043D\u0433\u043E\u043C \u0438 \u0442.\u043F.
feature_dtl = <a href\="/ru-RU/documentation/erlydtl">\u0428\u0430\u0431\u043B\u043E\u043D\u044B Django</a>
download_code = \u0441\u043A\u0430\u0447\u0430\u0442\u044C BeepBeep
cd_to_directory = \u043F\u0435\u0440\u0435\u0439\u0442\u0438 \u0432 \u0434\u0438\u0440\u0435\u043A\u0442\u043E\u0440\u0438\u044E BeepBeep
run_make = \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u043A\u043E\u043C\u0430\u043D\u0434\u0443 make
generate_app = \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043D\u043E\u0432\u043E\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0432 \u043A\u043E\u043C\u0430\u043D\u0434\u0443
your_app_name = \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435\u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F
destination_dir = \u041F\u0443\u0442\u044C\u041A\u041F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044E
this_generates_app = \u042D\u0442\u0430 \u043A\u043E\u043C\u0430\u043D\u0434\u0430 \u0441\u043E\u0437\u0434\u0430\u0441\u0442 \u043D\u043E\u0432\u043E\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435, \u0432\u043A\u043B\u044E\u0447\u0430\u044F \u0433\u043B\u0430\u0432\u043D\u044B\u0439 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440 (main_controller.erl)
to_run_the_sample = \u0427\u0442\u043E\u0431\u044B \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u043F\u0440\u0438\u043C\u0435\u0440\:
cd_to_app_dir = \u043F\u0435\u0440\u0435\u0439\u0434\u0438\u0442\u0435 \u0432 \u0434\u0438\u0440\u0435\u043A\u0442\u0440\u0438\u044E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F
compile_app = \u0417\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u0435 \u043A\u043E\u043C\u0430\u043D\u0434\u0443 make \u0434\u043B\u044F \u043A\u043E\u043C\u043F\u0438\u043B\u044F\u0446\u0438\u0438 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F
start_server = \u0417\u0430\u043F\u0443\u0441\u0438\u0442\u0435 \u0441\u0435\u0440\u0432\u0435\u0440\:
visit_sample_site = \u041E\u0442\u043A\u0440\u043E\u0439\u0442\u0435 \u0431\u0440\u0430\u0443\u0437\u0435\u0440 \u0438 \u043F\u0435\u0440\u0435\u0439\u0434\u0438\u0442\u0435 \u043D\u0430
primer_write_controller = \u0412\u044B \u043F\u0438\u0448\u0435\u0442\u0435 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440 \u0441 \u043D\u0430\u0431\u043E\u0440\u043E\u043C \u043C\u0435\u0442\u043E\u0434\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0432\u044B\u0433\u043B\u044F\u0434\u044F\u0442 \u0442\u0430\u043A\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C\:
where = \u0433\u0434\u0435
primer_what_is_action = Action \u2014 \u044D\u0442\u043E \u0441\u0442\u0440\u043E\u043A\u0430, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0437\u0430\u043F\u0440\u043E\u0441\u0443 \u0438\u0437 URL
primer_what_is_params = Params \u2014 \u044D\u0442\u043E \u043C\u0430\u0441\u0441\u0438\u0432 \u043E\u043F\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u044B\u0445 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u0432, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0431\u0443\u0434\u0443\u0442 \u043F\u0435\u0440\u0435\u0434\u0430\u043D\u044B \u0432 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440
primer_mapping = BeepBeep \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438 \u0442\u0440\u0430\u043D\u0441\u043B\u0438\u0440\u0443\u0435\u0442 \u0437\u0430\u043F\u0440\u043E\u0441\u044B \u0432 \u0432\u044B\u0437\u043E\u0432\u044B \u043C\u0435\u0442\u043E\u0434\u043E\u0432 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430. \u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0437\u0430\u043F\u0440\u043E\u0441 \u043A <code>\u201D/hello/show\u201D</code> \u0442\u0440\u0430\u043D\u0441\u043B\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0432 \u0432\u044B\u0437\u043E\u0432 <code>handle_request("show",[])</code> \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430  <code>hello_controller</code>
primer_example = \u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440\:
maps_to = \u0421\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0432\u044B\u0437\u043E\u0432\u0443
callback_filter_hook = \u0425\u0443\u043A
primer_return_view = \u0418\u0437 \u043C\u0435\u0442\u043E\u0434\u0430 <code>handle_request</code> \u043C\u044B \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u043C \u043A\u043E\u0440\u0442\u0435\u0436, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u043E\u043E\u0431\u0449\u0430\u0435\u0442 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0435, \u043A\u0430\u043A\u043E\u0435 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0435 (view) \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C. \u041F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u043D\u0430\u0445\u043E\u0434\u044F\u0442\u0441\u044F \u0432 \u0434\u0438\u0440\u0435\u043A\u0442\u043E\u0440\u0438\u0438 views.
primer_use_view = \u0412 \u043D\u0430\u0448\u0435\u043C \u043F\u0440\u0438\u043C\u0435\u0440\u0435 \u043C\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u043C \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0435,\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u043E\u0435 \u0432 \u043F\u043E\u0434\u0434\u0438\u0440\u0435\u043A\u0442\u043E\u0440\u0438\u0438 <code>hello</code> \u0432 \u0444\u0430\u0439\u043B\u0435 <code>show.html</code>
primer_view_example = \u041F\u0440\u0438\u043C\u0435\u0440 \u0448\u0430\u0431\u043B\u043E\u043D\u0430 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u044F\:
primer_view_example_result = \u0427\u0442\u043E \u043D\u0430 \u0432\u044B\u0445\u043E\u0434\u0435 \u0434\u0430\u0441\u0442\:
primer_view_explanation = \u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u00ABname\u00BB, \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u0435 \u0432 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0435, \u0431\u044B\u043B\u043E \u043F\u0435\u0440\u0435\u0434\u0430\u043D\u043E \u0432\u043E view, \u0438 \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u0430\u043D\u043E erlyDTL
primer_separation = \u0442\u0430\u043A\u043E\u0439 \u043F\u043E\u0434\u0445\u043E\u0434 \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u043E\u0442\u0434\u0435\u043B\u0438\u0442\u044C \u043B\u043E\u0433\u0438\u043A\u0443 \u043E\u0442 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u0438\u044F
primer_hooks = \u041C\u043E\u0436\u043D\u043E \u0442\u0430\u043A \u0436\u0435 \u0440\u0435\u0430\u043B\u0438\u0437\u043E\u0432\u0430\u0442\u044C \u0445\u0443\u043A <code>before_filter</code>, \u0447\u0442\u043E\u0431\u044B \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \u0437\u0430\u043F\u0440\u043E\u0441\u044B \u0434\u043E \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u0431\u0443\u0434\u0435\u0442 \u0432\u044B\u0437\u0432\u0430\u043D  <code>handle_request</code>.\n\
	\t\t\t\t\t\n\
	\u0424\u0438\u043B\u044C\u0442\u0440\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u0432\u043E\u0437\u0432\u0440\u0430\u0436\u0430\u0442\u044C \u043B\u0438\u0431\u043E \u0430\u0442\u043E\u043C ok, \u0432 \u0441\u043B\u0443\u0447\u0430\u0435, \u0435\u0441\u043B\u0438 \u0437\u0430\u043F\u0440\u043E\u0441 \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u0442, \u043B\u0438\u0431\u043E \u043E\u0434\u0438\u043D \u0438\u0437 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439, \u043F\u043E\u043D\u0438\u043C\u0430\u0435\u043C\u044B\u0445 BeepBeep, \u0442\u0430\u043A\u0438\u0445 \u043A\u0430\u043A\: <code>&\#123;render\u2026}</code> \u0438\u043B\u0438 <code>&\#123;redirect\u2026}</code>. \n\
	\n\
	\u0411\u043E\u043B\u0435\u0435 \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0432  <a href\="/ru-RU/documentation/hooks">\u0441\u0435\u043A\u0446\u0438\u0438 \u043E \u0445\u0443\u043A\u0430\u0445</a>.
how_it_works = \u041A\u0430\u043A \u044D\u0442\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442
faq_title = \u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F \u0447\u0430\u0441\u0442\u043E \u0437\u0430\u0434\u0430\u0432\u0430\u0435\u043C\u044B\u0445 \u0432\u043E\u043F\u0440\u043E\u0441\u043E\u0432
faq_to_be_filled = \u041A\u043E\u043B\u043B\u0435\u043A\u0446\u0438\u044F \u043F\u043E\u043F\u043E\u043B\u043D\u0438\u0442\u0441\u044F, \u043A\u0430\u043A \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u043E\u044F\u0432\u044F\u0442\u0441\u044F \u0432\u043E\u043F\u0440\u043E\u0441\u044B
faq_toc = \u0421\u043F\u0438\u0441\u043E\u043A \u0432\u043E\u043F\u0440\u043E\u0441\u043E\u0432
workflow_intro = BeepBeep \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u0432\u0441\u0435 \u0437\u0430\u043F\u0440\u043E\u0441\u044B \u0441\u043E\u0433\u043B\u0430\u0441\u043D\u043E \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u043D\u043E\u0439 \u0441\u0445\u0435\u043C\u0435
things_are_not_scary = \u041D\u0435\u0441\u043C\u043E\u0442\u0440\u044F \u043D\u0430 \u0442\u043E, \u0447\u0442\u043E \u0441\u0445\u0435\u043C\u0430 \u0432\u044B\u0433\u043B\u044F\u0434\u0438\u0442 \u0443\u0441\u0442\u0440\u0430\u0448\u0430\u044E\u0449\u0435, \u0432\u0441\u0435 \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u043E \u043F\u0440\u044F\u043C\u043E\u043B\u0438\u043D\u0435\u0439\u043D\u043E. \u0418\u0442\u0430\u043A,
request_into_app = MochiWeb \u043F\u0435\u0440\u0435\u043D\u0430\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u0437\u0430\u043F\u0440\u043E\u0441 \u0432 \u0432\u0430\u0448\u0435 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0435 (<code>web_app</code>)
app_web_loop = \u042D\u0442\u043E\u0442 \u0437\u0430\u043F\u0440\u043E\u0441 \u043F\u0435\u0440\u0435\u0445\u0432\u0430\u0442\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0435\u0439 <code>loop/1</code> \u0432 \u043C\u043E\u0434\u0443\u043B\u0435 <code>*_web</code>. \u0417\u0434\u0435\u0441\u044C, \u043F\u0440\u0438 \u0436\u0435\u043B\u0430\u043D\u0438\u0438, \u043C\u043E\u0436\u043D\u043E \u043E\u0431\u0440\u0431\u043E\u0442\u0430\u0442\u044C \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0439 \u0437\u0430\u043F\u0440\u043E\u0441 \u043D\u0430 \u0434\u043E\u0441\u0442\u0430\u0442\u043E\u0447\u043D\u043E \u043D\u0438\u0437\u043E\u043C \u0443\u0440\u043E\u0432\u043D\u0435, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0435\u0441\u043B\u0438 \u0432\u0430\u043C \u0437\u0430\u0445\u043E\u0447\u0435\u0442\u0441\u044F \u0441\u043C\u0435\u0448\u0430\u0442\u044C <a href\="http\://bitbucket.org/justin/webmachine/">WebMachine</a> \u0438 BeepBeep (\u0445\u043E\u0442\u044F \u044D\u0442\u043E\u043B\u0443\u0447\u0448\u0435 \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u043D\u0430 \u0443\u0440\u043E\u0432\u043D\u0435 middleware, \u0441\u043C. \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u044E\u0449\u0443\u044E \u0434\u0441\u0435\u043A\u0446\u0438\u044E \u0432 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438)
beepbeep_loop = \u0423\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u043F\u0440\u0435\u0434\u0430\u0435\u0442\u0441\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438 <code>beepbeep\:loop/1</code>. \u042D\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F \u0441\u043E\u0437\u0434\u0430\u0435\u0442 \u043D\u0430\u0447\u0430\u043B\u044C\u043D\u0443\u044E \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0443\u044E \u043E\u0440\u0443\u0436\u0435\u043D\u0438\u044F <code>Env</code>, \u043E\u043A\u0442\u043E\u0440\u0430\u044F \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0432\u043E \u0432\u0441\u0435\u043C \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u0438. \u042D\u0442\u0430 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u0443\u044E \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E, \u043A\u0430\u043A-\u0442\u043E\: \u043F\u0435\u0440\u0435\u0434\u0430\u043D\u043D\u044B\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B, \u043F\u0443\u0442\u0438 \u043A \u043C\u043E\u0434\u0443\u043B\u044F\u043C, \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043E \u0441\u0435\u0441\u0441\u0438\u0438 \u0438 \u0442.\u043F. \u0412\u043E\u0442 \u043F\u0440\u0438\u043C\u0435\u0440 \u0442\u0438\u043F\u0438\u0447\u043D\u043E\u0439 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 <code>Env</code>
call_to_dispatch = <code>beepbeep\:loop/1</code> \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u0442 <code>beepbeep\:dispatch/1</code>, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u0439 \u0438 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442 \u00AB\u043C\u0430\u0433\u0438\u044F\u00BB \u0438 \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u0433\u043E\u0442\u043E\u0432\u0443\u044E \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443, \u043B\u0438\u0431\u043E \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u044B\u0435 \u043A\u043E\u0434\u044B \u0441\u0442\u0430\u0442\u0443\u0441\u0430 \u0438 \u0440\u0435\u0434\u0438\u0440\u0435\u043A\u0442\u044B
env_is_passed_on = \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F <code>Env</code> \u043F\u0435\u0440\u0435\u0434\u0430\u0435\u0442\u0441\u044F \u0432 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u044B \u0438 \u0445\u0443\u043A\u0438
app_web_preprocess = \u0421\u043D\u0430\u0447\u0430\u043B\u0430 <code>beepbeep\:dispatch/2</code> \u043F\u043E\u043F\u044B\u0442\u0430\u0435\u0442\u0441\u044F \u0432\u044B\u0437\u0432\u0430\u0442\u044C <code>app_web\:preprocess/1</code>, \u0433\u0434\u0435 <code>app_web</code> \u2014 \u044D\u0442\u043E \u043C\u043E\u0434\u0443\u043B\u044C <code>*_web.erl</code> \u0432\u0430\u0448\u0435\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F.\n\
	\n\
	\u041C\u0435\u0442\u043E\u0434 <code>app_web\:preprocess/1</code> \u043C\u043E\u0436\u0435\u0442 \u0438\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0443\u044E Env, \u043A\u043E\u0442\u043E\u0440\u0430\u044F \u0435\u043C\u0443 \u043F\u0435\u0440\u0435\u0434\u0430\u0435\u0442\u0441\u044F \u0438 \u0432\u0435\u0440\u043D\u0443\u0442\u044C \u043D\u043E\u0432\u0443\u044E \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0443\u044E \u043E\u043A\u0440\u0443\u0436\u0435\u043D\u0438\u044F \u0438\u043B\u0438 \u043A\u043E\u0440\u0442\u0435\u0436 <code>{redirect, Path}</code>, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0437\u0430\u0441\u0442\u0430\u0432\u0438\u0442 BeepBeep \u043F\u0440\u0435\u043D\u0430\u043F\u0440\u0430\u0432\u0438\u0442\u044C \u0437\u0430\u043F\u0440\u043E\u0441 \u043D\u0430 \u0434\u0440\u0443\u0433\u0443\u044E \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443
get_controller = \u0412 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u043C \u0448\u0430\u0433\u0435 \u043C\u044B \u043F\u0440\u043E\u0432\u0435\u0440\u044F\u0435\u043C, \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442 \u043B\u0438 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0437\u0430\u043F\u0440\u043E\u0441\u0443. \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u044F \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u043E\u0432 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u044E\u0442\u0441\u044F \u043F\u043E \u0438\u043C\u0435\u043D\u0430\u043C \u043C\u043E\u0434\u0443\u043B\u0435\u0439. \u0415\u0441\u043B\u0438 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440 \u043D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D, \u043C\u044B \u043F\u0440\u0435\u0434\u043F\u043E\u043B\u0430\u0433\u0430\u0435\u043C, \u0447\u0442\u043E \u0431\u044B\u043B \u0437\u0430\u043F\u0440\u043E\u0448\u0435\u043D \u0441\u0442\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438\u0439 \u0444\u0430\u0439\u043B \u0438 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u043C \u0435\u0433\u043E
app_web_before_filter = \u041F\u0440\u0435\u0436\u0434\u0435, \u0447\u0435\u043C \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u043D\u0443\u0436\u043D\u044B\u0439 \u043C\u0435\u0442\u043E\u0434, \u043C\u044B \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u043C \u0444\u0438\u043B\u044C\u0442\u0440 <code>app_web\:before_filter/1</code>. \u0412 \u044D\u0442\u043E\u043C \u043C\u0435\u0442\u043E\u0434\u0435 \u043C\u043E\u0436\u043D\u043E, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0440\u0430\u0437\u043C\u0435\u0441\u0442\u0438\u0442\u044C \u043A\u043E\u0434, \u0430\u0432\u0442\u043E\u0440\u0438\u0437\u0443\u044E\u0449\u0438\u0439 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u043D\u0430 \u0441\u0430\u0439\u0442\u0435. \u0424\u0438\u043B\u044C\u0442\u0440 \u0434\u043E\u043B\u0436\u0435\u043D \u0432\u0435\u0440\u043D\u0443\u0442\u044C <code>ok</code> \u0438\u043B\u0438 \u043E\u0434\u0438\u043D \u0438\u0445 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439 \u043E\u0442\u0432\u0435\u0442\u0430 (\u0441\u043C. \u0441\u0445\u0435\u043C\u0443)
controller_before_filter = \u041F\u0440\u0435\u0436\u0434\u0435, \u0447\u0435\u043C \u0432\u044B\u0437\u0432\u0430\u0442\u044C \u043D\u0443\u0436\u043D\u044B\u0439 \u043C\u0435\u0442\u043E\u0434, \u043C\u044B \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u043C \u0444\u0438\u043B\u044C\u0442\u0440 <code>controller\:before_filter/0</code>. \u0412 \u044D\u0442\u043E\u043C \u043C\u0435\u0442\u043E\u0434\u0435 \u043C\u043E\u0436\u043D\u043E  \u0440\u0430\u0437\u043C\u0435\u0441\u0442\u0438\u0442\u044C \u043A\u043E\u0434, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u043A\u043E \u0432\u0441\u0435\u043C\u0443 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0443. \u0424\u0438\u043B\u044C\u0442\u0440 \u0434\u043E\u043B\u0436\u0435\u043D \u0432\u0435\u0440\u043D\u0443\u0442\u044C <code>ok</code> \u0438\u043B\u0438 \u043E\u0434\u0438\u043D \u0438\u0445 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439 \u043E\u0442\u0432\u0435\u0442\u0430 (\u0441\u043C. \u0441\u0445\u0435\u043C\u0443)
controller_before_render = \u0412 \u0441\u043B\u0443\u0447\u0430\u0435, \u0435\u0441\u043B\u0438 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043A\u043E\u0440\u0442\u0435\u0436 <code>{render...</code>, \u043F\u0440\u0435\u0436\u0434\u0435, \u0447\u0435\u043C \u043E\u0442\u043E\u0431\u0440\u0430\u0437\u0438\u0442\u044C \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443, BeepBeep \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u0442 \u043C\u0435\u0442\u043E\u0434 <code>before_render/1</code> \u043A\u043E\u043D\u0440\u043E\u043B\u043B\u0435\u0440\u0430. \u0424\u0438\u043B\u044C\u0442\u0440 \u0434\u043E\u0436\u0435\u043D \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0438\u0442\u044C \u043D\u043E\u0432\u044B\u0439 \u043A\u043E\u0440\u0442\u0435\u0436 <code>{render...</code> \u0438\u043B\u0438 \u043B\u044E\u0431\u043E\u0439 \u0438\u0437 \u0434\u0440\u0443\u0433\u0438\u0445 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439 \u043E\u0442\u0432\u0435\u0442\u0430. \u0422\u0430\u043A\u043E\u0439 \u0444\u0438\u043B\u044C\u0442\u0440 \u043C\u043E\u0436\u0435\u0442 \u043F\u043E\u043D\u0430\u0434\u043E\u0431\u0438\u0442\u044C\u0441\u044F, \u0435\u0441\u043B\u0438 \u0442\u0440\u0431\u0443\u0435\u0442\u0441\u044F \u0432\u044B\u0432\u0435\u0441\u0442\u0438 \u0447\u0442\u043E-\u043B\u0431\u043E \u0441\u043F\u0435\u0446\u0438\u0444\u0438\u0447\u043D\u043E\u0435 \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u0434\u0430\u043D\u043D\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430
app_web_before_render = \u0412 \u0441\u043B\u0443\u0447\u0430\u0435, \u0435\u0441\u043B\u0438 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043A\u043E\u0440\u0442\u0435\u0436 <code>{render...</code>, \u043F\u0440\u0435\u0436\u0434\u0435, \u0447\u0435\u043C \u043E\u0442\u043E\u0431\u0440\u0430\u0437\u0438\u0442\u044C \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0443, BeepBeep \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u0442 \u043C\u0435\u0442\u043E\u0434 <code>app_web\:before_render/2</code> \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F. \u0424\u0438\u043B\u044C\u0442\u0440 \u0434\u043E\u0436\u0435\u043D \u0432\u043E\u0437\u0432\u0440\u0430\u0442\u0438\u0442\u044C \u043D\u043E\u0432\u044B\u0439 \u043A\u043E\u0440\u0442\u0435\u0436 <code>{render...</code> \u0438\u043B\u0438 \u043B\u044E\u0431\u043E\u0439 \u0438\u0437 \u0434\u0440\u0443\u0433\u0438\u0445 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439 \u043E\u0442\u0432\u0435\u0442\u0430. \u0422\u0430\u043A\u043E\u0439 \u0444\u0438\u043B\u044C\u0442\u0440 \u043C\u043E\u0436\u0435\u0442 \u043F\u043E\u043D\u0430\u0434\u043E\u0431\u0438\u0442\u044C\u0441\u044F, \u0435\u0441\u043B\u0438 \u0442\u0440\u0431\u0443\u0435\u0442\u0441\u044F \u0432\u044B\u0432\u0435\u0441\u0442\u0438 \u0447\u0442\u043E-\u043B\u0438\u0431\u043E, \u043E\u0431\u0449\u0435\u0435 \u0434\u043B\u044F \u0432\u0441\u0435\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0433\u043B\u0430\u0432\u043D\u043E\u0435 \u043C\u0435\u043D\u044E)
controller_action = \u041F\u043E\u0441\u043B\u0435 \u043F\u0440\u043E\u0445\u043E\u0434\u0430 \u0432\u0441\u0435\u0445 \u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432 BeepBeep \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u0442 \u043C\u0435\u0442\u043E\u0434 <code>handle_request/2</code>. \u0412 \u0441\u043B\u0443\u0447\u0430\u0435, \u0435\u0441\u043B\u0438 \u0442\u0430\u043A\u043E\u0439 \u043C\u0435\u0442\u043E\u0434 \u043D\u0430\u0439\u0434\u0435\u043D, \u043E\u0442 \u043D\u0435\u0433\u043E \u043E\u0436\u0438\u0434\u0430\u0435\u0442\u0441\u044F \u043E\u0442\u0432\u0435\u0442 \u0432 \u0432\u0438\u0434\u0435 \u043E\u0434\u043D\u043E\u0433\u043E \u0438\u0437 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439 \u043E\u0442\u0432\u0435\u0442\u0430
the_end = \u041F\u043E\u0441\u043B\u0435 \u0432\u0441\u0435\u0433\u043E \u044D\u0442\u043E\u0433\u043E view \u043A\u043E\u043C\u043F\u0438\u043B\u0438\u0440\u0443\u0435\u0442\u044F \u0438 \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u0431\u0440\u0430\u0443\u0437\u0435\u0440
hooks_overview_title = \u0421 \u0432\u044B\u0441\u043E\u0442\u044B \u043F\u0442\u0438\u0447\u044C\u0435\u0433\u043E \u043F\u043E\u043B\u0435\u0442\u0430
hooks_overview = \u041A\u043E\u0433\u0434\u0430 BeepBeep \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u0437\u0430\u043F\u0440\u043E\u0441, \u043E\u043D \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u0442 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u044D\u0442\u0430\u043F\u044B\:
hooks_overview_2 = \u0422\u0430\u043A\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C \u0437\u0430\u043F\u0440\u043E\u0441 \u0438 \u043E\u0442\u0432\u0435\u0442 \u043F\u0440\u043E\u0445\u043E\u0434\u044F\u0442 \u0447\u0435\u0440\u0435\u0437\:
where_app_web = \u0433\u0434\u0435 <code>app_web</code> \u2014 \u044D\u0442\u043E \u043C\u043E\u0434\u0443\u043B\u044C <code>*_web.erl</code> \u0432\u0430\u0448\u0435\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F.
hooks_detailed = \u0414\u0435\u0442\u0430\u043B\u044C\u043D\u0430\u044F \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044F
environment_variable = \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u043E\u043A\u0440\u0443\u0436\u0435\u043D\u0438\u044F
params = \u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B
hook_app_web_preprocess = <span style\="color\:red;font-weight\: bold">\u042D\u0442\u043E\u0442 \u0444\u0438\u043B\u044C\u0442\u0440 \u0431\u043E\u043B\u044C\u0448\u0435 \u043D\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 middleware-\u043C\u043E\u0434\u0443\u043B\u044C</span>\n\
	\n\
	<span style\="color\: gray">\u042D\u0442\u043E\u0442 \u0444\u0438\u043B\u044C\u0442\u0440 \u043F\u043E\u043B\u0435\u0437\u0435\u043D, \u043A\u043E\u0433\u0434\u0430 \u0432\u0430\u043C \u043D\u0443\u0436\u043D\u043E \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u043D\u0438\u0437\u043A\u043E\u0443\u0440\u043E\u0432\u043D\u0435\u043D\u0432\u0443\u044E \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0445 \u0434\u0430\u043D\u043D\u044B\u0445 \u0434\u043E \u0442\u043E\u0433\u043E, \u0430\u043A \u043E\u043D\u0438 \u0434\u043E\u0439\u0434\u0443\u0442 \u0434\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F.</span>\n\
	\n\
	<span style\="color\: gray">\u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u0441\u0435 \u0441\u0441\u044B\u043B\u043A\u0438 \u0432\u0438\u0434\u0430 <code>http\://site/controller/action</code> \u043F\u0435\u0440\u0435\u0432\u0435\u0441\u0442\u0438 \u0432 <code>http\://site/locale/controller/actions</code>, \u0433\u0434\u0435 locale \u2014 \u044D\u0442\u043E <code>ru-RU</code>, <code>en-US</code> \u0438 \u0442.\u043F.</span>\n\
	\n\
	<span style\="color\: gray">\u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u043C\u043E\u0436\u043D\u043E \u0437\u0430\u0434\u0430\u0442\u044C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0443\u044E \u0444\u0443\u043D\u043A\u0446\u0438\u044E  <code>preprocess</code>\:</span>
returns = \u0412\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442
render_state_description = \u0414\u043B\u044F \u0432\u0441\u0435\u0445 \u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432 \u043D\u0438\u0436\u0435 RenderState \u043E\u0437\u043D\u0430\u0447\u0430\u0435\u0442 \u043E\u0434\u0438\u043D \u0438\u0437 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0445 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439
new_controller_description = \u0414\u043B\u044F \u0432\u0441\u0435\u0445 \u0444\u0438\u043B\u044C\u0442\u0440\u043E\u0432 \u043D\u0438\u0436\u0435 NewController \u043E\u0437\u043D\u0430\u0447\u0430\u0435\u0442 \u043E\u0434\u0438\u043D \u0438\u0437 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0445 \u043A\u043E\u0440\u0442\u0435\u0436\u0435\u0439
hook_app_web_before_filter = \u0412\u044B\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0434\u043E \u043B\u044E\u0431\u043E\u0433\u043E \u0432\u044B\u0437\u043E\u0432\u0430 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u043E\u0432. \u041C\u043E\u0436\u0435\u0442 \u043F\u0440\u0438\u0433\u043E\u0434\u0438\u0442\u044C\u0441\u044F \u0434\u043B\u044F \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438 \u043F\u0440\u043E\u0432\u0435\u0440\u043A\u0438 \u043F\u0440\u0430\u0432 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F\:
hook_controller_before_filter = \u0412\u044B\u0437\u044B\u0432\u0430\u0435\u0442 \u043F\u0435\u0440\u0435\u0434 \u043B\u044E\u0431\u044B\u043C \u043C\u0435\u0442\u043E\u0434\u043E\u043C \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430. \u041C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D, \u043A\u0430\u043A \u0432 \u043F\u0440\u0438\u043C\u0435\u0440\u0435 \u043D\u0438\u0436\u0435, \u0434\u043B\u044F \u043F\u0435\u0440\u0435\u0445\u043E\u0434\u0430 \u0441\u043E \u0441\u0442\u0430\u0440\u043E\u0439 \u0432\u0435\u0440\u0441\u0438\u0438 \u0441\u0430\u0439\u0442\u0430 \u043D\u0430 \u043D\u043E\u0432\u0443\u044E\n\
	\n\
	\u0421\u0442\u0430\u0440\u0430\u044F \u0432\u0435\u0440\u0441\u0438\u044F\: http\://site/news/item/id\n\
	\u041D\u043E\u0432\u0430\u044F \u0432\u0435\u0440\u0441\u0438\u044F\: http\://site/news/show/title
hook_controller_before_render = \u0412\u044B\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u043F\u0435\u0440\u0435\u0434 \u0440\u0435\u043D\u0434\u0435\u0440\u0438\u043D\u0433\u043E\u043C \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B. \u041C\u043E\u0436\u043D\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0435\u0441\u043B\u0438 \u0443 \u0432\u0430\u0441 \u0435\u0441\u0442\u044C \u043F\u043E\u0434\u0448\u0430\u0431\u043B\u043E\u043D, \u043E\u0434\u0438\u043D\u0430\u043A\u043E\u0432\u044B\u0439 \u0434\u043B\u044F \u0432\u0441\u0435\u0445 \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u043B\u0435\u0440\u0430 \u0438 \u0432\u044B\u0437 \u0445\u043E\u0442\u0438\u0442\u0435 \u043F\u0435\u0440\u0435\u0434\u0430\u0442\u044C \u0432 \u043D\u0435\u0433\u043E \u043A\u0430\u043A\u0438\u0435-\u0442\u043E \u0434\u0430\u043D\u043D\u044B\u0435. \u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u043D\u0430 \u044D\u0442\u043E\u043C \u0441\u0430\u0439\u0442\u0435 \u0432\u0441\u0435 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438 \u0438\u043C\u0435\u044E\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u043D\u0438\u0435. \u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u0432 \u0448\u0430\u0431\u043B\u043E\u043D \u043F\u0435\u0440\u0435\u0434\u0430\u044E\u0442\u0441\u044F \u043F\u0435\u0440\u0435\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0435 \u0441\u0442\u0440\u043E\u043A\u0438\:
for_now_refer_to_erlydtl_docs = \u041D\u0430 \u0434\u0430\u043D\u043D\u044B\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435\u0441\u044C \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0435\u0439 ErlyDTL \u043D\u0430
this_is_a_tentative_roadmap = \u042D\u0442\u043E \u043F\u0440\u0435\u0434\u0432\u0430\u0440\u0438\u0442\u0435\u043B\u044C\u043D\u044B\u0435 \u043F\u043B\u0430\u043D\u044B \u0440\u0430\u0437\u0432\u0438\u0442\u0438\u044F, \u043E\u043D\u0438 \u043C\u043E\u0433\u0443\u0442 \u043F\u043E\u043C\u0435\u043D\u044F\u0442\u044C\u0441\u044F
options_to_beepbeep = \u041F\u043E\u0437\u0432\u043E\u043B\u0438\u0442\u044C \u043A\u043E\u043D\u0442\u0440\u043E\u043B\u0438\u0440\u043E\u0432\u0430\u0442\u044C BeepBeep \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043E\u043F\u0446\u0438\u0439 (\u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, <strike>\u0441\u043C\u0435\u043D\u0430 \u0440\u0430\u0441\u043F\u043E\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u043D\u0435\u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0445\u0443\u043A\u043E\u0432, \u0442\u0430\u043A\u0438\u0445 \u043A\u0430\u043A <code>preprocess</code></strike><span style\="color\:red;">\u043D\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F</span>, \u043E\u043F\u0446\u0438\u0438 \u0434\u043B\u044F ErlyDTL \u0438 \u0442.\u043F.)
erlydtl_changes = \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0435 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0435 ErlyDTL \u0441\u043E\u0433\u043B\u0430\u0441\u043D\u043E \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u043C \u0437\u0430\u044F\u0432\u043A\u0430\u043C\:
webmachine_integration = \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u0430\u044F \u0438\u043D\u0442\u0435\u0433\u0440\u0430\u0446\u0438\u044F \u0441 WebMachine
yaws_integration = <strike>\u0412\u043E\u0437\u043C\u043E\u0436\u043D\u0430\u044F \u0438\u043D\u0442\u0435\u0433\u0440\u0430\u0446\u0438\u044F \u0441 Yaws</strike><span style\="color\:red;">\u043F\u0440\u0438 \u043F\u043E\u043C\u043E\u0449\u0438 ewgi, \u0441\u043C. \u043D\u0438\u0436\u0435</span>
pluggable_template_engines = \u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0434\u0440\u0443\u0433\u0438\u0435 \u0448\u0430\u0431\u043B\u043E\u043D\u043D\u044B\u0435 \u0434\u0432\u0438\u0436\u043A\u0438 (StringTemplate, erlydtl) (\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E, \u0432 \u0432\u0438\u0434\u0435 middleware, \u0441\u043C. \u043D\u0438\u0436\u0435)
better_error_handling_customization = \u0423\u043B\u0443\u0447\u0448\u0435\u043D\u043D\u0430\u044F \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u043E\u0448\u0438\u0431\u043E\u043A, \u043F\u043E\u0437\u0432\u043E\u043B\u0438\u0442\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044E \u043F\u0435\u0440\u0435\u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0442\u044C \u0432\u044B\u0432\u043E\u0434 \u043E\u0448\u0438\u0431\u043E\u043A
hook_app_web_before_render = \u0412\u044B\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u043F\u0435\u0440\u0435\u0434 \u0440\u0435\u043D\u0434\u0435\u0440\u0438\u043D\u0433\u043E\u043C \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u044B. \u041C\u043E\u0436\u043D\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C, \u043D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u0435\u0441\u043B\u0438 \u0443 \u0432\u0430\u0441 \u0435\u0441\u0442\u044C \u043F\u043E\u0434\u0448\u0430\u0431\u043B\u043E\u043D, \u043E\u0434\u0438\u043D\u0430\u043A\u043E\u0432\u044B\u0439 \u0434\u043B\u044F \u0432\u0441\u0435\u0445 \u0441\u0442\u0440\u0430\u043D\u0438\u0446 \u0441\u0430\u0439\u0442\u0430 \u0438 \u0432\u044B\u0437 \u0445\u043E\u0442\u0438\u0442\u0435 \u043F\u0435\u0440\u0435\u0434\u0430\u0442\u044C \u0432 \u043D\u0435\u0433\u043E \u043A\u0430\u043A\u0438\u0435-\u0442\u043E \u0434\u0430\u043D\u043D\u044B\u0435. \u041D\u0430\u043F\u0440\u0438\u043C\u0435\u0440, \u043D\u0430 \u044D\u0442\u043E\u043C \u0441\u0430\u0439\u0442\u0435 \u043D\u0430 \u0432\u0441\u0435\u0445 \u0441\u0442\u0440\u0430\u043D\u0438\u0446\u0430\u0445 \u0435\u0441\u0442\u044C \u0433\u043B\u0430\u0432\u043D\u043E\u0435 \u043C\u0435\u043D\u044E. \u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u0432 \u0448\u0430\u0431\u043B\u043E\u043D \u043F\u0435\u0440\u0435\u0434\u0430\u044E\u0442\u0441\u044F \u043F\u0435\u0440\u0435\u0432\u0435\u0434\u0435\u043D\u043D\u044B\u0435 \u0441\u0442\u0440\u043E\u043A\u0438\:
django_middleware = <strike>\u0420\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F Django-\u043F\u043E\u0434\u043E\u0431\u043D\u043E\u0433\u043E \u0443\u0440\u043E\u0432\u043D\u044F middleware. \u0421\u043C. <a href\="http\://docs.djangoproject.com/en/dev/topics/http/middleware/">http\://docs.djangoproject.com/en/dev/topics/http/middleware/</a></strike>  <span style\="color\:red">\u0441\u0434\u0435\u043B\u0430\u043D\u043E. \u043F\u0440\u0438 \u043F\u043E\u043C\u043E\u0449\u0438 ewgi \u043D\u0438\u0436\u0435</span>
ewgi = <strike>\u0420\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u0430 \u043A/\u0441\u043E\u0432\u043C\u0435\u0441\u0442\u0438\u043C\u043E\u0441\u0442\u0438 \u0441 ewgi, <a href\="http\://github.com/skarab/ewgi/">http\://github.com/skarab/ewgi/</a></strike> <span style\="color\:red">\u0432 \u043E\u0441\u043D\u043E\u0432\u043D\u043E\u043C \u0437\u0430\u043A\u043E\u043D\u0447\u0435\u043D\u043E, \u043A\u0440\u043E\u043C\u0435 \u043C\u0435\u043B\u043A\u0438\u0445 \u043D\u044E\u0430\u043D\u0441\u043E\u0432 (\u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u0437\u0430\u0433\u0440\u0443\u0437\u043A\u0438 \u0444\u0430\u0439\u043B\u043E\u0432 \u0432 \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u043E\u043C middlware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0435)</span>
contact = \u0421\u0432\u044F\u0436\u0438\u0442\u0435\u0441\u044C \u0441 \u043D\u0430\u043C\u0438\!
name = \u0418\u043C\u044F
site = \u0421\u0430\u0439\u0442
text = \u0412\u0430\u0448\u0438 \u043C\u044B\u0441\u043B\u0438
submit = \u041E\u0442\u043F\u0440\u0430\u0432\u0438\u0442\u044C
email_sent = \u0412\u0430\u0448\u0435 \u043F\u0438\u0441\u044C\u043C\u043E \u0431\u044B\u043B\u043E \u0443\u0441\u043F\u0435\u0448\u043D\u043E \u043E\u0442\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u043E. \u0421\u043F\u0430\u0441\u0438\u0431\u043E
intro_to_middleware = Middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u2014 \u044D\u0442\u043E \u043F\u0440\u043E\u0441\u0442\u044B\u0435 \u043C\u043E\u0434\u0443\u043B\u0438, \u043F\u0440\u0435\u0434\u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u044B\u0435 \u0434\u043B\u044F \u043A\u0430\u043A\u043E\u0433\u043E-\u0442\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u044F.\n\
	\n\
	<strong>\u041F\u0440\u0438\u043C\u0435\u0447\u0430\u043D\u0438\u0435\:</strong> Middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u0440\u0430\u0431\u043E\u0442\u0430\u044E\u0442 \u043D\u0430 \u043E\u0441\u043D\u043E\u0432\u0435 ewgi. \u0411\u043E\u043B\u044C\u0448\u0435 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u043F\u043E ewgi \u043C\u043E\u0436\u043D\u043E\u043D\u0430\u0439\u0442\u0438 \u0437\u0434\u0435\u0441\u044C\:\n\
	- <a href\="code.google.com/p/ewgi/wiki/EWGISpecification">\u0421\u043F\u0435\u0446\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F</a>\n\
	- <a href\="http\://github.com/skarab/ewgi/">\u041A\u043E\u0434 \u043D\u0430 GitHub'\u0435</a> (README \u043F\u043E\u0437\u0432\u043E\u043B\u0438\u0442 \u0432\u0430\u043C \u0431\u044B\u0441\u0442\u0440\u043E \u043D\u0430\u0447\u0430\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0443 \u0441 ewgi)\n\
	- <a href\="http\://github.com/skarab/ewgi_examples/">ewgi middleware examples</a>\n\
	\n\
	Middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u043C\u043E\u0433\u0443\u0442\:\n\
	- \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \u0437\u0430\u043F\u0440\u043E\u0441 \u0434\u043E \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u043E\u043D \u0434\u043E\u0441\u0442\u0438\u0433\u043D\u0435\u0442 \u0441\u043E\u0431\u0441\u0442\u0432\u0435\u043D\u043D\u043E \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u043E\u0441\u0442\u0435\u0439 Beepbeep \n\
	- \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0442\u044C \u043E\u0442\u0432\u0435\u0442, \u043E\u0442\u0434\u0430\u0432\u0430\u0435\u043C\u044B\u0439 BeepBeep, \u0434\u043E \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u043E\u043D \u0434\u043E\u0441\u0442\u0438\u0433\u043D\u0435\u0442 \u0431\u0440\u0430\u0443\u0437\u0435\u0440\u0430\n\
	- \u0438\u043B\u0438 \u0434\u0435\u043B\u0430\u0442\u044C \u0438 \u0442\u043E \u0438 \u0434\u0440\u0443\u0433\u043E\u0435\n\
	\n\
	Middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u043C\u043E\u0436\u043D\u043E \u0441\u0432\u044F\u0437\u0442\u044C \u0432 \u0446\u0435\u043F\u043E\u0447\u043A\u0443, \u0434\u043B\u044F \u0433\u0438\u0431\u043A\u043E\u0433\u043E \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u0437\u0430\u043F\u0440\u043E\u0441\u0430\u043C\u0438 \u0438 \u043E\u0442\u0432\u0435\u0442\u0430\u043C\u0438.\n\
	\n\
	\u0422\u0430\u043A\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C, middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u043C\u043E\u0433\u0443\u0442 \u043F\u0440\u0435\u0434\u043E\u0441\u0442\u0430\u0432\u043B\u044F\u0442\u044C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0435\u0435\:\n\
	- \u0414\u043E \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u0437\u0430\u043F\u0440\u043E\u0441 \u0434\u043E\u0441\u0442\u0438\u0433\u043D\u0435\u0442 Beepbeep\:\n\
	-- \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430 url\n\
	-- \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0430 \u0438 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u0441\u0435\u0441\u0441\u0438\u044F\u043C\u0438\n\
	-- \u0434\u0435\u043A\u043E\u0434\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 JSON'\u0430\n\
	-- \u0430\u0443\u0442\u0435\u043D\u0442\u0438\u0444\u0438\u043A\u0430\u0446\u0438\u044F\n\
	-- \u043A\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435\n\
	- \u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A BeepBeep \u0432\u044B\u0434\u0430\u0441\u0442 \u043E\u0442\u0432\u0435\u0442\:\n\
	-- \u0435\u043E\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0432 JSON\n\
	-- XSLT-\u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u043E\u0442\u0432\u0435\u0442\u0430\n\
	-- \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0430 ETags\n\
	\n\
	Middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u0440\u0430\u0431\u043E\u0442\u0430\u044E\u0442 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C\:\:\n\
	- \u0432 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u043F\u0435\u0440\u0435\u0434\u0430\u0435\u0442\u0441\u044F <code>ewgi_context</code> \u0438 \u0441\u0441\u044B\u043B\u043A\u0430 \u043D\u0430 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0432 \u0446\u0435\u043F\u043E\u0447\u043A\u0435\n\
	- the\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u043E\u043F\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E \u0438\u0437\u043C\u0435\u043D\u044F\u0435\u0442 \u0437\u0430\u043F\u0440\u043E\u0441 (\u043F\u0435\u0440\u0435\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442 URL'\u044B, \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u0432\u0445\u043E\u0434\u043D\u044B\u0435 \u0434\u0430\u043D\u043D\u044B\u0435 \u0438 \u0443\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0435\u0442 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0435 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u0438 \u0442.\u043F.)\n\
	- \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u0442 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0439 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0432 \u0446\u0435\u043F\u043E\u0447\u043A\u0435, \u043F\u0435\u0440\u0435\u0434\u0430\u0432\u0430\u044F \u0432 \u043D\u0435\u0433\u043E \u043C\u043E\u0434\u0438\u0444\u0438\u0446\u0438\u0440\u043E\u0432\u0430\u043D\u044B\u0439 <code>ewgi_context</code>\n\
	- \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u043E\u0442\u0432\u0435\u0442\n\
	- \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u043E\u043F\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E \u043C\u043E\u0434\u0438\u0444\u0438\u0446\u0438\u0440\u0443\u0435\u0442 \u043E\u0442\u0432\u0435\u0442\n\
	- \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0432\u043E\u0437\u0432\u0440\u0430\u0449\u0430\u0435\u0442 \u043C\u043E\u0434\u0438\u0444\u0438\u0446\u0438\u0440\u043E\u0432\u0430\u043D\u044B\u0439 \u043E\u0442\u0432\u0435\u0442\n\
	\n\
	\u0414\u043B\u044F \u0442\u043E\u0433\u043E, \u0447\u0442\u043E\u0431\u044B \u043E\u0431\u0435\u0441\u043F\u0435\u0447\u0438\u0442\u044C \u0442\u0430\u043A\u0443\u044E \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C, \u043A\u043C\u043E\u043F\u043E\u043D\u0435\u043D\u0442 \u0434\u043E\u043B\u0436\u0435\u043D \u043F\u0435\u0440\u0434\u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0444\u0443\u043D\u043A\u0446\u0438\u044E <code>run/2</code> \u0438\u043B\u0438 <code>run/3</code> \u043A\u0430\u043A \u043F\u043E\u043A\u0430\u0437\u0430\u043D\u043E \u043D\u0438\u0436\u0435\:
intro_to_middleware_2 = \u041F\u043E\u0440\u044F\u0434\u043E\u043A, \u0432 \u043A\u043E\u0442\u043E\u0440\u043E\u043C \u0432\u044B\u0437\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B, \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F \u0432 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 <code>loop/1</code> \u0432 \u043C\u043E\u0434\u0443\u043B\u0435 <code>*_web.erl</code> \u0432\u0430\u0448\u0435\u0433\u043E \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F\:
intro_to_middleware_3 = \u041A\u0430\u043A \u0432\u0438\u0434\u043D\u043E, Beepbep \u0441\u0430\u043C \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u043C, \u043F\u0440\u043E\u0441\u0442\u043E \u043E\u043D \u044F\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0438\u043C \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u043C \u0432 \u0446\u0435\u043F\u043E\u0447\u043A\u0435.\n\
	\n\
	\u041F\u043E\u0441\u043C\u043E\u0442\u0440\u0438\u043C, \u043A\u0430 \u043A\u044D\u0442\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u0432 \u0440\u0435\u0430\u043B\u044C\u043D\u043E\u0439 \u0436\u0438\u0437\u043D\u0438.\n\
	\n\
	\u041C\u044B \u0445\u043E\u0442\u0438\u043C, \u0447\u0442\u043E\u0431\u044B URL'\u044B \u043D\u0430\u0448\u0435\u0433\u043E \u0441\u0430\u0439\u0442\u0430 \u0432\u044B\u0433\u043B\u044F\u0434\u0435\u043B\u0438 \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C\: \n\
	\n\
	<code>http\://site/locale/controller/action</code>\n\
	\n\
	\u0415\u0441\u043B\u0438 \u043A \u043D\u0430\u0435\u043C\u0443 \u0441\u0430\u0439\u0442\u0443 \u0438\u0434\u0435\u0442 \u0437\u0430\u043F\u0440\u043E\u0441 \u0432 \u0432\u0438\u0434\u0435\:\n\
	\n\
	<code>http\://site/controller/action</code>\n\
	\n\
	\u043C\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0435\u0440\u0435\u043D\u0430\u043F\u0440\u0430\u0432\u0438\u0442\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u043D\u0430 URL \u0441 \u043B\u043E\u043A\u0430\u043B\u044C\u044E.\n\
	\n\
	\u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u043C\u044B \u0434\u043E\u043B\u0436\u043D\u044B\:\n\
	- \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0432\u0445\u043E\u0434\u044F\u0449\u0438\u0439 URL\n\
	- \u0435\u0441\u043B\u0438 \u043E\u043D \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043E \u043B\u043E\u043A\u0430\u043B\u0438, \u0441\u043E\u0445\u0440\u0430\u043D\u0438\u0442\u044C \u0435\u0435 \u0432 \u0441\u0435\u0441\u0441\u0438\u0438\n\
	- \u0435\u0441\u043B\u0438 \u043E\u043D \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u044E \u043E \u043B\u043E\u043A\u0430\u043B\u0438, \u0443\u0431\u0440\u0430\u0442\u044C \u043B\u043E\u043A\u0430\u043B\u044C \u0438\u0437 URL'\u0430 \u0438 \u043F\u0435\u0440\u0435\u0434\u0430\u0442\u044C \u0437\u0430\u043F\u0440\u043E\u0441 \u0434\u0430\u043B\u044C\u0448\u0435 \u043F\u043E \u0446\u0435\u043F\u043E\u0447\u043A\u0435\n\
	- \u0435\u0441\u043B\u0438 \u043B\u043E\u043A\u0430\u043B\u0438 \u043D\u0435\u0442, \u043F\u0435\u0440\u0435\u043D\u0430\u043F\u0440\u0430\u0432\u0438\u0442\u044C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F \u043D\u0430 URL, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u043B\u043E\u043A\u0430\u043B\u044C\n\
	\n\
	\u0412\u043E\u0442 \u0438 \u043A\u043E\u0434\:
intro_to_middleware_4 = Middleware-\u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0441\u043A\u043E\u043B\u044C \u0443\u0433\u043E\u0434\u043D\u043E \u0441\u043B\u043E\u0436\u043D\u044B\u043C\u0438, \u043D\u043E \u043B\u0443\u0447\u0448\u0435 \u043E\u0433\u0440\u0430\u043D\u0438\u0447\u0438\u0432\u0430\u0442\u044C \u0438\u0445 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u0438 \u043A\u0430\u043A\u0438\u043C-\u043B\u0438\u0431\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u044B\u043C \u0444\u0443\u043D\u043A\u0446\u0438\u043E\u043D\u0430\u043B\u043E\u043C.
